4Alisa/12/Documents/ВводТехникиВРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ВводТехникиВРаботу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтатусТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВСистеме</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТехникаВРаботе</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

4Alisa/12/AccumulationRegisters/ТоварыВСистеме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВСистеме</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

4Alisa/12/AccumulationRegisters/СтатусТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>СтатусТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыТовара</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

4Alisa/12/Enums/СтатусыТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыТовара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРемонте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списанно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

4Alisa/12/Documents/ВводТехникиВРаботу/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	// регистр ТоварыВСистеме Расход
	Движения.ТоварыВСистеме.Записывать = Истина;
	Для Каждого ТекСтрокаТехникаВРаботе Из ТехникаВРаботе Цикл
		Движение = Движения.ТоварыВСистеме.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТехникаВРаботе.Товар;
		Движение.Партия = Ссылка;
		Движение.РабочееМесто = Справочники.РабочиеМеста.ГлавныйСклад;
		Движение.Количество = ТекСтрокаТехникаВРаботе.Количество;
	КонецЦикла;

	// регистр ТоварыВСистеме Приход
	Движения.ТоварыВСистеме.Записывать = Истина;
	Для Каждого ТекСтрокаТехникаВРаботе Из ТехникаВРаботе Цикл
		Движение = Движения.ТоварыВСистеме.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТехникаВРаботе.Товар;
		Движение.Партия = Ссылка;
		Движение.РабочееМесто = ТекСтрокаТехникаВРаботе.РабочееМесто;
		Движение.Количество = ТекСтрокаТехникаВРаботе.Количество;
	КонецЦикла;
	
	Движения.СтатусТовара.Записывать = Истина;
	Для Каждого ТекСтрокаТехникаВРаботе Из ТехникаВРаботе Цикл
		ДвижениеР = Движения.СтатусТовара.Добавить();
		ДвижениеР.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвижениеР.Период = Дата;
		ДвижениеР.Товар = ТекСтрокаТехникаВРаботе.Товар;
		ДвижениеР.Документ = Ссылка;
		ДвижениеР.Статус = Перечисления.СтатусыТовара.Новый;
		ДвижениеР.Количество = ТекСтрокаТехникаВРаботе.Количество;
		
		ДвижениеП = Движения.СтатусТовара.Добавить();
		ДвижениеП.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеП.Период = Дата;
		ДвижениеП.Товар = ТекСтрокаТехникаВРаботе.Товар;
		ДвижениеП.Документ = Ссылка;
		ДвижениеП.Статус = Перечисления.СтатусыТовара.ВРаботе;
		ДвижениеП.Количество = ТекСтрокаТехникаВРаботе.Количество;		
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
